src/1C/Catalogs/ДанныеСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДанныеСервера</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Логины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Порты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Порт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/1C/CommonModules/ДанныеСервисаПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
Процедура УстановитьСтандартныйСерверИПорт(ОписаниеСервиса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	Справочник.ДанныеСервера КАК ДанныеСервераТ
		|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОписаниеСервиса.Сервер(Выборка.Наименование, Выборка.Описание);
		Если ЗначениеЗаполнено(Выборка.Логин) Тогда
			ОписаниеСервиса.ИмяПоУмолчанию(Выборка.Логин);			
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Порт) Тогда
			ОписаниеСервиса.ПортПоУмолчанию(Выборка.Порт);			
		КонецЕсли;
		
		ВыборкаЛогин = Выборка.Логины.Выбрать();
		Логины = Новый Массив;
		Пока ВыборкаЛогин.Следующий() Цикл
			Логины.Добавить(ВыборкаЛогин.Логин);		
		КонецЦикла;
		Если Логины.Количество() > 0 Тогда
			ОписаниеСервиса.ИменаПользователейСервера(СтрСоединить(Логины, ";"));
		КонецЕсли;
		
		ВыборкаПорт = Выборка.Порты.Выбрать();
		Порты = Новый Массив;
		Пока ВыборкаПорт.Следующий() Цикл
			Порты.Добавить(ВыборкаПорт.Порт);		
		КонецЦикла;
		Если Порты.Количество() > 0 Тогда
			ОписаниеСервиса.ПортыСервера(СтрСоединить(Порты, ";"));
		КонецЕсли;
	КонецЦикла;	

	ОписаниеСервиса.Безопасность("Basic")
		.БазоваяАвторизация("Basic");
	
	
КонецПроцедуры
#КонецОбласти
